tap "homebrew/bundle"
tap "homebrew/cask"

# Essentials
brew "git"
brew "wget"
brew "curl"
brew "jq"
brew "tree"
brew "gnupg"

# Dev toolchains
brew "nvm"
brew "pyenv"

# Databases (opcional)
brew "postgresql@16"
brew "redis"

# CLI utils
brew "ripgrep"
brew "fzf"

# Apps (casks)
cask "visual-studio-code"
cask "iterm2"
cask "docker"
cask "postman"
cask "jetbrains-toolbox"

# Python build deps
brew "openssl@3"
brew "readline"
brew "zlib"
brew "xz"
